Tasks/Задачи_РКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>Задачи_РКД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИзменяетСтадию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Задачи_ПКД</v8:Type>
						<v8:Type>cfg:DocumentRef.Рекламации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомментария</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

InformationRegisters/СостояниеЗамера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостояниеЗамера</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЗамера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗамера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектИзменения</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ПроверитьГабаритныеЧертежи</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиГабаритныхЧертежей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановоеЗначениеПроектирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлановоеЗначениеПроектирования</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончанияВКалендарных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончанияВРабочих</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланРазработкиВДнях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Задачи_ПКД</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи_РКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗамера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗамера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проектный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Строительный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/Задачи_РКД/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаКлиенте
Перем ИзмененыСлужебныеНастройки, ПутьКФайлуПДМ, СтруктураПроектноеВремяРазработкиВДнях, КомментарийУвеличеияПродолжительности, ТекущиеДействие, НачальныйПланРазработкиВДнях;
&НаКлиенте
Перем НормаВремениИзиенена;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Элементы.СтадияКомплекта.Видимость = Ложь;

	Иначе
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, омСотрудники.СотрудникиОбъекта(Объект.ОбъектТЗ, Ложь));
		КрайРКД	= ПолучитьКрайРКД();
		ВидимостьИДоступностьЭлементов();
		
	КонецЕсли;
	
	омКомментарииНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКомментарий);
	ДополнительныеПараметры = Неопределено;
	Этаформа.Комментарий_авто = омКомментарииНаСервере.Получить_HTML_комментарий(Объект.Комментарии, , , ДополнительныеПараметры);
	Элементы.ГруппаКомментарий.Заголовок = омКомментарийКлиентСервер.ПолучитьЗаголовокСтраницы(ДополнительныеПараметры);

	омДлительныеОперцииНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаДлительныеДействия);
	
	Элементы.СоздатьОбщуюЗадачуЗамерщик.Видимость 	= ЗначениеЗаполнено(Замерщик);
	Элементы.СоздатьОбщуюЗадачуВедущему.Видимость 	= ЗначениеЗаполнено(ВедущийКонструктор);
	Элементы.СоздатьОбщуюЗадачуМенеджеру.Видимость 	= ЗначениеЗаполнено(Менеджер);
	Элементы.СоздатьОбщуюЗадачуДизайнеру.Видимость 	= ЗначениеЗаполнено(Дизайнер);
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		
		Элементы.НормаВремени.ТолькоПросмотр		= Истина;
		Элементы.ПланРазработкиВДнях.Доступность 	= РольДоступна("ГлавныйКонструктор");	
		
	КонецЕсли;
	
	Элементы.КнопкаИстория.Видимость = РольДоступна("Программист");  
	
КонецПроцедуры

Процедура ВидимостьИДоступностьЭлементов()
	
	Прочитать();
	
	НаименованиеДействия = "";
	Если омФайлыPDM.КонтрольДлительнойОперации(НаименованиеДействия, Объект.Ссылка) Тогда
		
		ТолькоПросмотр = Истина;
		Элементы.Группа2.Доступность = Ложь;
		Сообщить("Длительное действие " + НаименованиеДействия);
		
	КонецЕсли;
	
	ТипыЗадачКонструктора = омЗадачиПКДПовтор.ТипыЗадачКонструктора();

	стДанные = РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Объект.Ссылка);
	ТекущиеСостояние 		= стДанные.Состояние;
	
	Если Объект.Выполнена Тогда
		
		ТолькоПросмотр 										= Истина;
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;
		СтадияКомплекта = "Задача выполнена";
		
	Иначе
		
		СтадияКомплекта = омСтадииКомплекта.ПолучитьСтадиюКомплекта(Объект.ОбъектТЗ).ПолноеНаименование;
		Если НЕ ТипыЗадачКонструктора.Найти(Объект.ТипЗадачи) = Неопределено Тогда
			
			Элементы.ГруппаКнопкаКонструктора.Видимость 		= Истина;	
			Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
			
		ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда
			
			Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
			Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Истина;
			
		ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ГЧОжидание Тогда
			Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
			Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ОбновитьИсполнителя.Видимость = Элементы.ГруппаКнопкаКонструктора.Видимость;
	
	Состояние = ТекущиеСостояние; 
	
	ИнфрмацияГЧ();
	
	мТипыЗадачДляКонструктора = омЗадачиПКДПовтор.ТипыЗадачКонструктора();
	Если НЕ (мТипыЗадачДляКонструктора.Найти(Объект.ТипЗадачи) = Неопределено ИЛИ РольДоступна("ПолныеПрава")) Тогда
		Элементы.Исполнитель.ТолькоПросмотр = Истина;	
	КонецЕсли;
	
	НормаВремени = стДанные.НормаВремени;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбщуюЗадачу(Команда)
	
	ПараметыОткрытия 					= омЗадачаОбщаяНаКлиенте.ПолучитьПараметОткрытияОбщейЗадачи();
	ПараметыОткрытия.Проект 			= Объект.Проект;  
	ПараметыОткрытия.ОбъектАдресации    = Объект.Ссылка; 
	
	Если ТекущийЭлемент.Имя = "СоздатьОбщуюЗадачуЗамерщик" Тогда
		ПараметыОткрытия.Исполнитель 	= Замерщик;
	ИначеЕсли ТекущийЭлемент.Имя = "СоздатьОбщуюЗадачуВедущему" Тогда
		ПараметыОткрытия.Исполнитель 	= ВедущийКонструктор;
	ИначеЕсли ТекущийЭлемент.Имя = "СоздатьОбщуюЗадачуМенеджеру" Тогда
		ПараметыОткрытия.Исполнитель 	= Менеджер;
	ИначеЕсли ТекущийЭлемент.Имя = "СоздатьОбщуюЗадачуДизайнеру" Тогда
		ПараметыОткрытия.Исполнитель 	= Дизайнер;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметыОткрытия.Исполнитель) Тогда
		ПараметыОткрытия.Исполнитель = омСотрудники.ПолучитьПользователяПоСотруднтку(ПараметыОткрытия.Исполнитель);
	КонецЕсли;
	
	омЗадачаОбщаяНаКлиенте.ОткрытьПустуюОбщуюЗадачу(ПараметыОткрытия, ЭтаФорма);	
	
КонецПроцедуры

#Область Комментарии

&НаКлиенте
Процедура ОбщаяКомандаКомментарий(Команда)
	омКомментарииНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяКомандаВсеКомментарии(Команда)
	омКомментарииНаКлиенте.ВсеКомментарий(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры

#КонецОбласти

Процедура ИнфрмацияГЧ()
	
	Дата_статуса_ГЧ 	= Дата(1, 1, 1);
	ДатаНачалаРаботы	= Дата_статуса_ГЧ;
	ОбъектИзмененияГЧ 	= Неопределено;
	СтатусЗамера 		= Перечисления.СтатусыЗамера.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзделияКомплект.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
	|	ИзделияКомплект.Ссылка КАК Комплект
	|ПОМЕСТИТЬ врГабаритныйЧертеж
	|ИЗ
	|	Справочник.ИзделияКомплект КАК ИзделияКомплект
	|ГДЕ
	|	ИзделияКомплект.Ссылка = &Комплект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЕСТЬNULL(СостояниеЗамера.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК Дата_статуса_ГЧ,
	|	ЕСТЬNULL(СостояниеЗамера.ОбъектИзменения, НЕОПРЕДЕЛЕНО) КАК ОбъектИзмененияГЧ,
	|	ЕСТЬNULL(СостояниеЗамера.СтатусЗамера, НЕОПРЕДЕЛЕНО) КАК СтатусЗамера,
	|	ЕСТЬNULL(ДатыКомплекта.БезГабаритногоЧертежа, ЛОЖЬ) КАК БезГабаритногоЧертежа,
	|	врГабаритныйЧертеж.ГабаритныйЧертеж КАК ГабаритныйЧертеж
	|ИЗ
	|	Справочник.ИзделияКомплект КАК ИзделияКомплект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеЗамера КАК СостояниеЗамера
	|		ПО ИзделияКомплект.ГабаритныйЧертеж = СостояниеЗамера.ОбъектЗамера
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
	|		ПО (ДатыКомплекта.Комплект = ИзделияКомплект.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ врГабаритныйЧертеж КАК врГабаритныйЧертеж
	|		ПО ИзделияКомплект.Ссылка = врГабаритныйЧертеж.Комплект
	|ГДЕ
	|	ИзделияКомплект.Ссылка = &Комплект
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(СостояниеЗамера.ОбъектИзменения, НЕОПРЕДЕЛЕНО),
	|	ЕСТЬNULL(СостояниеЗамера.СтатусЗамера, НЕОПРЕДЕЛЕНО),
	|	ЕСТЬNULL(ДатыКомплекта.БезГабаритногоЧертежа, ЛОЖЬ),
	|	врГабаритныйЧертеж.ГабаритныйЧертеж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаймингЗадачСрезПоследних.Период) КАК ДатаНачалаРаботы
	|ИЗ
	|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадачСрезПоследних
	|ГДЕ
	|	ТаймингЗадачСрезПоследних.Состояние = &Состояние
	|	И ТаймингЗадачСрезПоследних.ТипЗадачи В(&ТипЗадачи)
	|	И ТаймингЗадачСрезПоследних.Задача = &Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаймингЗадачСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ПустаяСсылка)) КАК СтатусЗадачи
	|ИЗ
	|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", 	Объект.ОбъектТЗ);
	Запрос.УстановитьПараметр("Задача", 	Объект.Ссылка);
	Запрос.УстановитьПараметр("ТипЗадачи", 	омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	Запрос.УстановитьПараметр("Состояние", 	Перечисления.СостоянияЗадач.ВРаботеКонструктора);
	
	Результат 	= Запрос.ВыполнитьПакет();
	
	Выборка 	= Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Дата_статуса_ГЧ > ЭтаФорма.Дата_статуса_ГЧ Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
		Иначе
			БезГабаритногоЧертежа = Выборка.БезГабаритногоЧертежа;	
		КонецЕсли;
	КонецЦикла;
	
	Выборка 	= Результат[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);	
	КонецЦикла; 
	
	Выборка 	= Результат[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СтатусЗадачи = Перечисления.СтатусыЗадач.ОжиданиеГЧ Тогда
			
			Элементы.ДекорацияГЧ.Видимость 	= Истина;
			ТолькоПросмотр 					= Истина;
			Элементы.ДекорацияГЧ.Заголовок	= "Ожидание готовности габаритного чертежа";
			
		Иначе
			
			Элементы.ДекорацияГЧ.Видимость 	= Ложь;
			ТолькоПросмотр 					= Ложь;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Элементы.БезГабаритногоЧертежа.Видимость 	= БезГабаритногоЧертежа;
	Элементы.ГруппаЗамеры.Видимость 			= НЕ БезГабаритногоЧертежа;
	//Элементы.Группа22.Видимость 				= НЕ Элементы.ДекорацияГЧ.Видимость;
	Элементы.ФормаЗаписать.Доступность			= НЕ Элементы.ДекорацияГЧ.Видимость;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда
		Элементы.НормаВремени.Видимость = Ложь;	
	КонецЕсли;
	
	НормаВремениИзиенена = Ложь;

	ТекущиеДействие = "";
	
	Элементы.НазначениеПрав.Видимость = Ложь;
	
	ПутьКФайлуПДМ = омФайлы.ПолучитьПутьКФайлуПДМ(Объект.ОбъектТЗ);
	ИзмененыСлужебныеНастройки = Ложь;
	Элементы.ГруппаИстория.Видимость = Ложь;
	ВидимостьКнопок();
	Заголовок = Объект.Наименование;
	
	СтруктураДанных = ПолучитьПланРазработкиВДнях(Объект.Ссылка);
	
	ПланРазработкиВДнях = СтруктураДанных.ПланРазработкиВДнях;
	НачальныйПланРазработкиВДнях = ПланРазработкиВДнях;
	
	Если ПланРазработкиВДнях > 0 И НЕ СтруктураДанных.ДатаНачала = Дата(1, 1, 1) Тогда
		
		Элементы.ДекорацияДатаОкончания.Видимость = Истина;
		Элементы.ДекорацияДатаОкончания.Заголовок = "Дата окончания " + Формат(ТекущаяДата() + ПланРазработкиВДнях * 24 * 3600, "ДЛФ=DD");
		
	Иначе
		
		Элементы.ДекорацияДатаОкончания.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКрайРКД()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыКомплекта.КрайРКД КАК КрайРКД
	|ИЗ
	|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
	|ГДЕ
	|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Объект.ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КрайРКД; 
	КонецЦикла; 
	
	Возврат Дата(1, 1, 1);
	
КонецФункции // ПолучитьКрайПКД()

#Область Команды

#Область  КомандыКонструктора

&НаКлиенте
Процедура НачатьВыполнение(Команда)
	
	Если Модифицированность Тогда
		
		ПоказатьПредупреждение(, "Не обходимо сохранить задачу.");
		Возврат;
		
	КонецЕсли;
	
	Если ПланРазработкиВДнях = 0 Тогда
	
		ПоказатьПредупреждение(, "Не заполнен План разработки в днях");
		Возврат;
	
	КонецЕсли;
	
	ЗаписатьПланРазработкиВДняхНаСервере(Объект.Ссылка, ПланРазработкиВДнях, КомментарийУвеличеияПродолжительности);

	КонструкторОбъекта = КонтрольСоответствияКонструкторов(Объект.ОбъектТЗ, Объект.Исполнитель);
	
	Если НЕ КонструкторОбъекта = Объект.Исполнитель Тогда
			
		ПоказатьПредупреждение(, "Конструктор в объекте " + КонструкторОбъекта + " не соответствует исполнителю");
		Возврат;
		
	КонецЕсли;
	
	НуженЗапускСкрипта = НЕ ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ПриостановкаКонструктором");

	стДанные = ДействияНаСервере("НачатьВыполнение", Объект.Ссылка, Объект.Исполнитель);
	ТекущиеСостояние 		= стДанные.Состояние;
	ВидимостьКнопок();
	
	Если НуженЗапускСкрипта Тогда
		
		омДлительныеОперцииНаКлиенте.ЗапускДлительногоДействия(Объект.Ссылка, "НачатьВыполнение");
		ПодключитьОбработчикОжидания("КонтрольДлительногоДействия", 0.1, Истина);
	
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыполнение(Команда)
	
	Если Модифицированность Тогда
		
		ПоказатьПредупреждение(, "Не обходимо сохранить задачу.");
		Возврат;
		
	КонецЕсли;
	омДлительныеОперцииНаКлиенте.ЗапускДлительногоДействия(Объект.Ссылка, "ЗавершениеРаботы");
	ПодключитьОбработчикОжидания("КонтрольДлительногоДействия", 0.1, Истина);

КонецПроцедуры 

&НаКлиенте
Процедура Отложить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Приостановить(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	стДанные = ДействияНаСервере("Приостановить", Объект.Ссылка, Объект.Исполнитель);
	ТекущиеСостояние 		= стДанные.Состояние;
	ВидимостьКнопок();
	
КонецПроцедуры
#КонецОбласти

#Область КомандыВедущегоКонструктороа

&НаКлиенте
Процедура ДоработкаВедущийКонструктор(Команда)
	
	Если Модифицированность Тогда
		Записать();	
	КонецЕсли;
	
	ОповещенияПослеЗакрытияВыбораФайла = Новый ОписаниеОповещения("ПослеЗакрытияВыбораФайла", ЭтаФорма);
	
	ПараметрыДоработки = Новый Структура("ОбъектДействий, ДействиеПриОкончании, НаименованиеДействия, ИмяДействияДляФайла"
										, Объект.Ссылка, "ДоработкаВедущийКонструктор", "Перемещение файла в каталог PDM", "Доработка");
	ОткрытьФорму("ОбщаяФорма.ФормаПереносИнформацииВPDM", ПараметрыДоработки, , , , , ОповещенияПослеЗакрытияВыбораФайла, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры // ПослеЗакрытияВыбораФайла()

&НаКлиенте
Процедура Утвердить(Команда)
	
	Ожидание = Ложь;
	СообщениеОЗавершении = ВозможноЗавершение(Ожидание);
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	омДлительныеОперцииНаКлиенте.ЗапускДлительногоДействия(Объект.Ссылка, "Утверждение");
	ПодключитьОбработчикОжидания("КонтрольДлительногоДействия", 0.1, Истина);
	
	Если ПустаяСтрока(СообщениеОЗавершении) Тогда 
		стДанные = ДействияНаСервере("Утверждение", Объект.Ссылка, Объект.Исполнитель);
		ЗакрытьРекламациюНаСервере(Объект.ОбъектТЗ);
	Иначе
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыводаВопросаУтверждения", ЭтаФорма, Новый Структура("Ожидание", Ожидание));
		ПоказатьВопрос(Оповещение, СообщениеОЗавершении + " Продолжить?", РежимДиалогаВопрос.ДаНет, , , "Утверждение");	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыводаВопросаУтверждения(Значение, ДополнительныеПараметры) Экспорт
	
	Если Значение = КодВозвратаДиалога.Да Тогда
		
		ЗакрытьРекламациюНаСервере(Объект.ОбъектТЗ);
		
		Если ДополнительныеПараметры.Свойство("Ожидание") Тогда
			
			Если ДополнительныеПараметры.Ожидание = 1 Тогда
				
				стДанные = ДействияНаСервере("ОжиданиеГЧ", Объект.Ссылка);
				
			ИначеЕсли ДополнительныеПараметры.Ожидание = 0 Тогда
				
				Объект.Комментарий = Объект.Комментарий + Символы.ВК + "Перевод ГЧ в статус Рабочий был выполнен после начала конструирования. Требуется проверка.";
				Записать();
				стДанные = ДействияНаСервере("ДоработкаВедущийКонструктор", Объект.Ссылка, Объект.Исполнитель);
				
			ИначеЕсли ДополнительныеПараметры.Ожидание = 2  Тогда
				Объект.Комментарий = Объект.Комментарий + Символы.ВК + "Ожидается согласование.";
				Записать();
				стДанные = ДействияНаСервере("ОжиданиеСогласования", Объект.Ссылка, Объект.Исполнитель);
			КонецЕсли;	
			
			Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти 

&НаСервереБезКонтекста
Процедура ЗакрытьРекламациюНаСервере(ОбъектТЗ)

	омЗадачиРКДНаСервере.ЗакрытьРекламацию(ОбъектТЗ);	

КонецПроцедуры // ЗакрытьРекламациюНаСервере()

&НаКлиенте
Процедура История(Команда)
	
	История = ДействияНаСервере("История", Объект.Ссылка);
	Элементы.ГруппаИстория.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИсторию(Команда)
	Элементы.ГруппаИстория.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти 


&НаКлиенте
Функция ВозможноЗавершение(Ожидание)

	Если БезГабаритногоЧертежа Тогда
		Ожидание = 0;
		Возврат "";	
	КонецЕсли;
	
	Если НЕ ЕстьУтверждение(Объект.ОбъектТЗ) Тогда
	
		Ожидание = 2;
		
		Возврат Строка(Объект.ОбъектТЗ) + " не согласован.";
	
	ИначеЕсли ЗначениеЗаполнено(ГабаритныйЧертеж) Тогда
		
		Если СтатусЗамера = ПредопределенноеЗначение("Перечисление.СтатусыЗамера.Рабочий") Тогда
			Если ДатаНачалаРаботы < Дата_статуса_ГЧ Тогда
				Ожидание = 0;
				Возврат "Работа над задачей началась раньше, чем перевод ГЧ в статус Рабочий.";
			КонецЕсли;
		Иначе	
			Ожидание = 1;
			Возврат "Статус габаритного чертежа " + СтатусЗамера + " для перевода в производства необходим статус Рабочий.";
		КонецЕсли;
	
	Иначе
		Ожидание = 1;
		Возврат "Незаполнен габаритный чертеж.";
	КонецЕсли; 
	
		Ожидание = 0;
	Возврат "";

КонецФункции // ВозможноЗавершение()

&НаСервереБезКонтекста
Функция ЕстьУтверждение(ОбъектТЗ)


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ДатыКомплекта.РКД_отдельно_от_композиции, ЛОЖЬ) КАК РКД_отдельно_от_композиции
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &ОбъектТЗ";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат НЕ Выборка.РКД_отдельно_от_композиции;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ЕстьУтверждение()

&НаСервереБезКонтекста
Функция КонтрольСоответствияКонструкторов(ОбъектТЗ, КонструкторПользователь)

	Возврат омКонструктор.ПолучитьДанныеОбъекта(ОбъектТЗ, КонструкторПользователь).КонструкторПользователь;		

КонецФункции // КонтрольСоответствияКонструкторов()

&НаСервереБезКонтекста
Функция ДействияНаСервере(Действие, Задача, Параметр = Неопределено)
	
	Возврат Задачи.Задачи_РКД.ДействияНаСервере(Действие, Задача, Параметр);
	
КонецФункции // ДействияНаСервере()  

&НаКлиенте
Процедура ВидимостьКнопок()
	
	Если ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ВРаботеКонструктора") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Ложь;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Истина;
		Элементы.КнопкаСбросКонструктором.Видимость 				= Истина;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Истина;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ОжиданиеКонструктором") Тогда
		
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаСбросКонструктором.Видимость 				= Ложь;
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Истина;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ПриостановкаКонструктором") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Истина;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаСбросКонструктором.Видимость 				= Истина;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		
	КонецЕсли;
	
	Если Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость Тогда
		
		 ВозвможностьПеревести = омЗадачиПКДСервер.ВозвможностьПеревестиЗадачуВРаботу(Объект.Исполнитель);
		 
		 Если ВозвможностьПеревести.ЕстьВозможность Тогда
		 
			 Элементы.ДекорацияНетВозможностиЗапустить.Видимость = Ложь;
			 
		 Иначе
			 
			 Элементы.ДекорацияНетВозможностиЗапустить.Видимость 	= Истина;
			 Элементы.ДекорацияНетВозможностиЗапустить.Заголовок 	= ВозвможностьПеревести.Описание;
			 Элементы.КнопкаНачатьВыполнениеКонструктор.Доступность = Ложь;
		 
		 КонецЕсли; 
		 
	 Иначе
		 
		 Элементы.ДекорацияНетВозможностиЗапустить.Видимость = Ложь;
		 
	 КонецЕсли;
	

	
	
КонецПроцедуры // ВидимостьКнопок()

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	ИзмененыСлужебныеНастройки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
	Если ЭтаФорма.Открыта() Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ИзмененыСлужебныеНастройки Тогда
		ИзменитьСостоянияНаСервере(Объект.Ссылка, Объект.ОбъектТЗ, Объект.ТипЗадачи, Объект.СтатусЗадачи, Состояние);		
	ИначеЕсли НЕ Объект.НеИзменяетСтадию Тогда
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Объект.Ссылка);
	КонецЕсли;
	
	Если ПланРазработкиВДнях > 0 И НЕ ПланРазработкиВДнях = НачальныйПланРазработкиВДнях Тогда
		ЗаписатьПланРазработкиВДняхНаСервере(Объект.Ссылка, ПланРазработкиВДнях, КомментарийУвеличеияПродолжительности);
	КонецЕсли; 
	
	Если НормаВремениИзиенена Тогда
	
		НормаВремениИзиенена = Ложь;
		ЗаписатьНормуВремениНаСервере(Объект.Ссылка, НормаВремени);
	
	КонецЕсли;
	
	Оповестить("ИзменениеРКД", Объект.ОбъектТЗ);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ЗаписатьНормуВремениНаСервере(Задача, НормаВремени)

	МенеджерРегистра = РегистрыСведений.ТаймингЗадач;
	стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(, , , , НормаВремени);
	МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные); 

КонецПроцедуры


&НаСервереБезКонтекста
Процедура ИзменитьСостоянияНаСервере(Задача, ОбъектТЗ, ТипЗадачи, СтатусЗадачи, Состояние)
	
	Исполнитель = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаймингЗадачСрезПоследних.Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Исполнитель = Выборка.Исполнитель			
	КонецЦикла;
	
	МЗ = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	МЗ.Период =  ТекущаяДата();
	МЗ.Автор = ПараметрыСеанса.ТекущийПользователь;
	МЗ.Задача = Задача;
	МЗ.Исполнитель = Исполнитель;
	МЗ.Состояние = Состояние;
	МЗ.Статус = СтатусЗадачи;
	МЗ.ТипЗадачи = ТипЗадачи;
	
	МЗ.Записать();
	
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
	
КонецПроцедуры // ИзменитьСостоянияНаСервере()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Вставить содержимое обработчика
КонецПроцедуры

 &НаСервереБезКонтекста
Процедура СнятьСВыполненияНаСервере(Ссылка, Выполнение = Ложь)
	Об = Ссылка.ПолучитьОбъект();
	об.Выполнена = Выполнение;
	Об.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СнятьСВыполнения(Команда)
	СнятьСВыполненияНаСервере(Объект.Ссылка);
	Закрыть();
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьВыполнение(Команда)
	СнятьСВыполненияНаСервере(Объект.Ссылка, Истина);
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ИзменениеРКД", Объект.ОбъектТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлПДМ(Команда)
	
	Если ПустаяСтрока(ПутьКФайлуПДМ) Тогда
		ПоказатьПредупреждение(,"Не удалось построить путь к файлу");
	Иначе
		
		Файл = Новый Файл(ПутьКФайлуПДМ);
		
		Если Файл.Существует() Тогда
			ФайловаяСистемаКлиент.ОткрытьПроводник(ПутьКФайлуПДМ);
		Иначе
			ПоказатьПредупреждение(,"Не существует файла " + ПутьКФайлуПДМ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьИсполнителяНаСервере(ОбъектТЗ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Конструктор
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ДанныеКомплектаСрезПоследних.Конструктор = Пользователи.Сотрудник
		|ГДЕ
		|	ДанныеКомплектаСрезПоследних.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", ОбъектТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Конструктор;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИсполнителя(Команда)
	Объект.Исполнитель = ОбновитьИсполнителяНаСервере(Объект.ОбъектТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГЧ(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТаймингЗадачи(Команда)
	ОткрытьФорму("ОбщаяФорма.ТаймигОбъекта", Новый Структура("ОбъектТайминга", Объект.Ссылка), ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПланРазработкиВДнях(Ссылка)

	СтруктураВозврата = Новый Структура("ПланРазработкиВДнях, ДатаНачала", 0, Дата(1, 1, 1));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях КАК ПланРазработкиВДнях,
		|	ПлановоеЗначениеПроектированияСрезПоследних.ДатаНачала КАК ДатаНачала
		|ИЗ
		|	РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних(, Задача = &Задача) КАК ПлановоеЗначениеПроектированияСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЦикла;
	
	Возврат СтруктураВозврата;

КонецФункции // ПолучитьПланРазработкиВДнях()

&НаСервереБезКонтекста
Процедура ЗаписатьПланРазработкиВДняхНаСервере(Задача, ПланРазработкиВДнях, КомментарийУвеличеияПродолжительности)

	РегистрыСведений.ПлановоеЗначениеПроектирования.ЗаписатьПлановоеЗначениеЗадачи(Задача, , ПланРазработкиВДнях, КомментарийУвеличеияПродолжительности); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПланРазработкиВДняхПриИзменении(Элемент)

	СтруктураДанных = ПолучитьПланРазработкиВДнях(Объект.Ссылка);
	
	Если ПланРазработкиВДнях > 0 И НЕ СтруктураДанных.ДатаНачала = Дата(1, 1, 1) Тогда
		
		Элементы.ДекорацияДатаОкончания.Видимость = Истина;
		Элементы.ДекорацияДатаОкончания.Заголовок = "Дата окончания " + Формат(ТекущаяДата() + ПланРазработкиВДнях * 24 * 3600, "ДЛФ=DD");
		
	Иначе
		
		Элементы.ДекорацияДатаОкончания.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКомментарияУвеличенияСрока(Строка, Параметры) Экспорт
	Если НЕ Строка = Неопределено Тогда
		КомментарийУвеличеияПродолжительности = Строка;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СбросКонструктором(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ТекущиеДействие = "СбросКонструктором";
	омДлительныеОперцииНаКлиенте.ЗапускДлительногоДействия(Объект.Ссылка, ТекущиеДействие);
	ПодключитьОбработчикОжидания("КонтрольДлительногоДействия", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьООшибке(Команда)
	омЗадачаОбщаяНаКлиенте.ОткрытьПодготовленныюЗадачу(Объект.Ссылка);
КонецПроцедуры



#Область ДлительныеДействия

&НаКлиенте
Процедура ОбщаяКомандаДлительныеДействия(Команда)
	омДлительныеОперцииНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры 

&НаКлиенте
Процедура КонтрольДлительногоДействия()

	НаименованиеДействия = "";
	Если омФайлыPDM.КонтрольДлительнойОперации(НаименованиеДействия, Объект.Ссылка) Тогда
		
		ТолькоПросмотр = Истина;
		Элементы.Группа2.Доступность = Ложь;
		
		ПодключитьОбработчикОжидания("КонтрольДлительногоДействия", 0.5, Истина);
		
	Иначе
		
		Если Не ПустаяСтрока(ТекущиеДействие) Тогда
			
			Если Модифицированность Тогда
				Записать();
			КонецЕсли;
			
			стДанные = ДействияНаСервере(ТекущиеДействие, Объект.Ссылка, Объект.Исполнитель);
			ТекущиеСостояние 		= стДанные.Состояние;
			
		КонецЕсли;
		ТолькоПросмотр 					= Ложь;
		Элементы.Группа2.Доступность 	= Истина;
		ВидимостьИДоступностьЭлементов();
		ПриОткрытии(Ложь);
		ВидимостьКнопок();
		
	КонецЕсли;
	
	омДлительныеОперцииНаКлиенте.ВывестиДлителноеДействиеНаФорму(ЭтаФорма);
	
КонецПроцедуры // КонтрольДлительногоДействия()

	
#КонецОбласти

&НаКлиенте
Процедура НормаВремениПриИзменении(Элемент)
	НормаВремениИзиенена = Истина;
КонецПроцедуры
